2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpAfnemerindicatie/data/VerhuisUitDoelbinding-TC04-2-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ID>*</ID>
            <ONTVANGENDEPARTIJ>25005</ONTVANGENDEPARTIJ>
            <ABONNEMENT>5670005</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>505005</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>postcode gebied Hillegom 2180 - 2182</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van afnemerindicatie</brp:categorieDienst>
  </brp:parameters>
  <brp:meldingen>
    <brp:melding brp:objecttype="Melding" brp:referentieID="1">
      <brp:regelCode>BRLV0027</brp:regelCode>
      <brp:soortNaam>Waarschuwing</brp:soortNaam>
      <brp:melding>De geleverde persoon valt niet meer binnen de doelbindingspopulatie van het abonnement.</brp:melding>
    </brp:melding>
  </brp:meldingen>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>05005</brp:code>
    <brp:naam>Verhuizing intergemeentelijk</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>505004</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
		  <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
		  <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>103432620</brp:burgerservicenummer>
          <brp:administratienummer>1032846572</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
		  <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Cees</brp:voornamen>
          <brp:voorvoegsel>de</brp:voorvoegsel>
          <brp:scheidingsteken>-</brp:scheidingsteken>
          <brp:geslachtsnaamstam>Vries</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
		  <brp:datum>1981-10-02</brp:datum>
          <brp:gemeenteCode>0519</brp:gemeenteCode>
          <brp:woonplaatsnaam>Honselersdijk</brp:woonplaatsnaam>
          <brp:omschrijvingLocatie>omschrijving geboorte locatie Cees</brp:omschrijvingLocatie>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
		  <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Toevoeging" brp:objectSleutel="*" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag(0,0,-3)}</brp:datumAanvangGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>P</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>P</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>${vandaag(0,0,-3)}</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234567890123450</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>6030185910431230</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>5105</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Plein</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>P</brp:afgekorteNaamOpenbareRuimte>
            <brp:gemeentedeel>Bennebroek</brp:gemeentedeel>
            <brp:huisnummer>5</brp:huisnummer>
            <brp:postcode>2120AB</brp:postcode>
            <brp:woonplaatsnaam>SRPUC50151-6-Woonplaats</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Wijziging" brp:objectSleutel="*" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
			<brp:datumAanvangGeldigheid>${vandaag(0,0,-4)}</brp:datumAanvangGeldigheid>
            <brp:datumEindeGeldigheid>${vandaag(0,0,-3)}</brp:datumEindeGeldigheid>
            <brp:actieAanpassingGeldigheid>*</brp:actieAanpassingGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>P</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>P</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>${vandaag(0,0,-4)}</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234567890123450</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>6030185910431230</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>5105</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Plein</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>P</brp:afgekorteNaamOpenbareRuimte>
            <brp:gemeentedeel>Hillegom</brp:gemeentedeel>
            <brp:huisnummer>4</brp:huisnummer>
            <brp:postcode>2182ZZ</brp:postcode>
            <brp:woonplaatsnaam>SRPUC50151-5-Woonplaats</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Verval" brp:objectSleutel="*" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
			<brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>*</brp:actieVerval>
            <brp:datumAanvangGeldigheid>${vandaag(0,0,-4)}</brp:datumAanvangGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>P</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>P</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>${vandaag(0,0,-4)}</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234567890123450</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>6030185910431230</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>5105</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Plein</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>P</brp:afgekorteNaamOpenbareRuimte>
            <brp:gemeentedeel>Hillegom</brp:gemeentedeel>
            <brp:huisnummer>4</brp:huisnummer>
            <brp:postcode>2182ZZ</brp:postcode>
            <brp:woonplaatsnaam>SRPUC50151-5-Woonplaats</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>
